Repository: ctu-fee-group/Christofel
Catalog: src/Plugins/Christofel.Courses/Resources/CoursesPlugin.*.resx
Languages: cs_cz

# CHOOSE_COURSE_Join
source: To join any course, click on the button below.
cs_cz: Pro přiřazení do předmětu klikni na příslušné tlačítko pod zprávou.

# CHOOSE_COURSE_Leave
source: To leave any course, click on the button below.
cs_cz: Pro odebrání z předmětu klikni na příslušné tlačítko pod zprávou.

# CHOOSE_COURSE_Toggle
source: To toggle any course, click on the button below.
cs_cz: Pro přepnutí předmětu klikni na příslušné tlačítko pod zprávou.

# CHOOSE_DEPARTMENT_Join
source: Choose a department that the course you are looking for is under.
cs_cz: Zvol katedru, pod kterou je vypsaný předmět, který hledáš.

# CHOOSE_DEPARTMENT_Leave
source: Choose a department that the course you are looking for is under.
cs_cz: Zvol katedru, pod kterou je vypsaný předmět, který hledáš.

# CHOOSE_DEPARTMENT_Toggle
source: Choose a department that the course you are looking for is under.
cs_cz: Zvol katedru, pod kterou je vypsaný předmět, který hledáš.

# CHOOSE_SEMESTER_Join
source: Choose a semester to join enrolled courses from.
cs_cz: Zvol semestr podle kterého chceš přiřadit předměty.

# CHOOSE_SEMESTER_Leave
source: Choose a semester to leave enrolled courses from.
cs_cz: Zvol semestr podle kterého chceš odebrat předměty.

# CHOOSE_SEMESTER_Toggle
source: Choose a semester to toggle enrolled courses from.
cs_cz: Zvol semestr podle kterého chceš přepnout předměty.

# COURSES_MISSING
source: These courses were found for the given criteria, but are not on the server: {0}. If you want these to be added, contact administrators.
cs_cz: Našel jsem předměty, které vyhovují kritériúm, ale nejsou na dostupné serveru: {0}. Pokud chceš, aby byly předměty přidány, kontaktuj administrátory.

# COURSES_NOT_FOUND
source: Could not find any course for the given criteria.
cs_cz: Nenašel jsem žádné předměty pro dané kritérium

# COURSES_SUCCESSFULLY_Join_PREFIX
source: Successfully assigned you to these courses
cs_cz: Přiřadil jsem tě do těchto předmětů

# COURSES_SUCCESSFULLY_Leave_PREFIX
source: Successfully deassigned you from these courses
cs_cz: Odebral jsem tě z těchto předmětů

# COURSES_SUCCESSFULLY_Toggle_PREFIX
source: Successfully toggled these courses
cs_cz: Přepnul jsem ti tyto předměty

# COURSE_BY_CHANNEL_NOT_FOUND
source: Could not find any course for the given channel.
cs_cz: Nenašel jsem žádné předměty pro daný kanál.

# COURSE_BY_DEPARTMENT_JOIN_BUTTON
source: Join course by department
cs_cz: Přiřadit předmět podle katedry

# COURSE_BY_DEPARTMENT_LEAVE_BUTTON
source: Leave course by department
cs_cz: Odebrat předmět podle katedry

# COURSE_BY_KEYS_JOIN_BUTTON
source: Join course by code
cs_cz: Přiřadit předmět podle kódu

# COURSE_BY_KEYS_LEAVE_BUTTON
source: Leave course by code
cs_cz: Odebrat předmět podle kódu

# COURSE_BY_SEMESTER_CHOOSE
source: Found these enrolled courses in the chosen semester.
cs_cz: Našel jsem, že máš zapsané tyto předměty pro zvolený semestr

# COURSE_BY_SEMESTER_JOIN_BUTTON
source: Join enrolled courses by semester
cs_cz: Přiřadit zapsané předměty podle semestru

# COURSE_BY_SEMESTER_LEAVE_BUTTON
source: Leave enrolled courses by semester
cs_cz: Odebrat zapsané předměty podle semestru

# COURSE_BY_SEMESTER_NOT_FOUND
source: You do not have any enrolled courses in the chosen semester.
cs_cz: Nenašel jsem u tebe žádné zapsané předměty pro zvolený semestr.

# COURSE_MODAL_TEXTINPUT_Toggle
source: Course codes
cs_cz: Kódy předmětů

# COURSE_MODAL_TEXTINPUT_Leave
source: Course codes
cs_cz: Kódy předmětů

# COURSE_MODAL_TEXTINPUT_Join
source: Course codes
cs_cz: Kódy předmětů

# COURSE_MODAL_PLACEHOLDER_Toggle
source: Course codes separated by space
cs_cz: Kódy předmětů oddělené mezerou

# COURSE_MODAL_PLACEHOLDER_Leave
source: Course codes separated by space
cs_cz: Kódy předmětů oddělené mezerou

# COURSE_MODAL_PLACEHOLDER_Join
source: Course codes separated by space
cs_cz: Kódy předmětů oddělené mezerou

# COURSE_MODAL_TITLE_Join
source: Join courses by codes
cs_cz: Přiřadit předměty podle kódu

# COURSE_MODAL_TITLE_Leave
source: Leave courses by codes
cs_cz: Odebrat předměty podle kódu

# COURSE_MODAL_TITLE_Toggle
source: Toggle courses by codes
cs_cz: Přepnout předměty podle kódu

# DEPARTMENTS_COURSES
source: Found these courses for the chosen department.
cs_cz: Našel jsem tyto předměty pro zvolenou katedru

# ERROR
source: There was an error, contact administrators.
cs_cz: Došlo k chybě, kontaktuj administrátory.

# NOT_AUTHENTICATED
source: You are not authenticated. This feature can be used only by authenticated users.
cs_cz: Nejsi ověřený. Tato funkce je dostupná pouze pro ověřené uživatele.

# SEARCH_COURSES_BUTTON
source: Search courses
cs_cz: Vyhledat předměty

# SEARCH_COURSES_BY_SEMESTER_BUTTON
source: Search for enrolled courses
cs_cz: Vyhledat zapsané předměty

# SEARCH_COURSE_SUCCESS
source: Found these courses in the given criteria.
cs_cz: Našel jsem tyto předměty podle daných kritérií.

# SEARCH_MODAL_PLACEHOLDER
source: Search criteria separated by space
cs_cz: Kritéria vyhledávání oddělená mezerou

# SEARCH_MODAL_TEXTINPUT
source: Course codes, names
cs_cz: Kódy nebo názvy předmětů či jejich části

# SEARCH_MODAL_TITLE
source: Search courses
cs_cz: Vyhledat předměty podle kódu nebo názvu

# SEMESTER_CURRENT
source: Current semester
cs_cz: Tento semestr

# SEMESTER_NEXT
source: Next semester
cs_cz: Příští semestr

# SEMESTER_PREVIOUS
source: Previous semester
cs_cz: Předešlý semestr

# SHOW_LANGUAGE
source: Show in english
cs_cz: Zobrazit v češtině

# MAIN_MESSAGE_CONTENT
source: :information_source: (BETA) **Interactive course channels assignment** English version is currently only partially supported. Courses and departments will be in the Czech language. If you are unsure how to find course you are looking for, contact others in <#1020326829623607356>. Hello, here you can interactively choose what course channels you want to see here. What buttons do should be obvious from the labels, but below you can find the full instructions. This is currently a beta, if you find an error, report it to <#753695738671792211>. Buttons **join/leave course by code** will open a modal with a text input. You can put **whole codes** of courses into the input separated by space. When you confirm the modal, the bot will assign you to/remove you from these courses. If you know only a part of a code or a name, try the button search courses. Buttons **join/leave course by department** will send you a message to choose a department (unfortunately the names will be in Czech). When you choose a department, the bot will send you a message with courses that belong to the given department. You can click on the course you want to be added to/removed from to. Buttons **join/leave course by semester** will send you a message to select a semester (previous, current, next). After you choose a semester, the bot will add/remove the courses you are enrolled in for the given semester. Button **search courses** will open a modal with a text input. You can put parts of codes or parts of names (_some may work in english_) to search for. Button **search courses by semester** will send you a message to select a semester. After you select a semester, the bot will send you a message to choose what courses you want to add or remove. Good luck!
cs_cz: :information_source: (BETA) **Interaktivní navolení kanálů předmětů / Interactive course channels assignment** For **english version**, click on the last button below this message. Ahoj, tady si můžeš interaktivně navolit kanály předmětů pomocí tlačítek pod zprávou. Tlačítka by měla být snad jasná, ale níže jsou vysvětlivky pro každé z tlačítek. V tuto chvíli se jedná o beta verzi, pokud máš nápad na zlepšení, ozvi se v <#1019875949216542800>. Pokud jsi narazil na chybu, ozvi se v <#753695738671792211>. Tlačítka **přiřadit/odebrat předměty podle kódu** otevřou modal s jedním textovým vstupem. Do vstupu je třeba zadat **celé** kódy předmětů, které si chceš přiřadit nebo odebrat. Pokud neznáš celý kód předmětu, který chceš najít, použij tlačítko vyhledat předměty. Tlačítka **přiřadit/odebrat předměty podle katedry** ti odešlou zprávu, ve které si budeš moct zvolit danou katedru. Po zvolení katedry ti bot pošle všechny předměty, které pod danou katedru spadají a máme je zde na serveru. Zakliknutím konkrétního předmětu si ho můžeš přidat nebo odebrat. Tlačítka **přiřadit/odebrat předměty podle semestru** ti odešlou zprávu pro zvolení semestru (minulý, tento, příští). Po zakliknutí semestru ti bot přiřadí nebo odebere předměty, které máš v daném semestru zapsané. Pokud bot nějaké na serveru nenajde, dá ti je vědět a můžeš nám poslat požadavek do návrhů na přidání kanálů těchto předmětů. Tlačítko **vyhledat předměty** otevře modal s jedním textovým vstupem. Do vstupu můžeš psát části názvů nebo kódů předmětů, bot zkusí najít všechny vyhovující předměty a dá ti na výběr si je přidat nebo odebrat. Tlačítko **vyhledat předměty podle semestru** ti pošle všechny předměty pro daný semestr, aby sis je mohl individuálně přidat nebo odebrat.
